Revit 2017 API
Railing.RailingCanBeHostedByElement Method
 Checks whether the specified element can be used as a host for the railing. The host can be a stairs, ramp, floor, slab edge, wall or roof.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public bool RailingCanBeHostedByElement(
	ElementId hostId
)
Visual Basic
Public Function RailingCanBeHostedByElement ( _
	hostId As ElementId _
) As Boolean
Visual C++
public:
bool RailingCanBeHostedByElement(
	ElementId^ hostId
)
Parameters
hostId
Type: Autodesk.Revit.DB.ElementId
 Element id to check.
Return Value
 True if the element can be used as host for the railing.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace